[
    {
        "title": "Meta raises the bar with open source Llama 3 LLM",
        "link": "https://www.artificialintelligence-news.com/2024/04/19/meta-raises-bar-open-source-llama-3-llm/",
        "description": "Meta has introduced Llama 3, the next generation of its state-of-the-art open source large language model (LLM). The tech giant claims Llama 3 establishes new performance benchmarks, surpassing previous industry-leading models like GPT-3.5 in real-world scenarios.\n\"With Llama 3, we..."
    },
    {
        "title": "Mixtral 8x22B sets new benchmark for open models",
        "link": "https://www.artificialintelligence-news.com/2024/04/18/mixtral-8x22b-sets-new-benchmark-open-models/",
        "description": "Mistral AI has released Mixtral 8x22B, which sets a new benchmark for open source models in performance and efficiency. The model boasts robust multilingual capabilities and superior mathematical and coding prowess.\nMixtral 8x22B operates as a Sparse Mixture-of-Experts (SMoE) model,..."
    },
    {
        "title": "SAS aims to make AI accessible regardless of skill set with packaged AI models",
        "link": "https://www.artificialintelligence-news.com/2024/04/17/sas-aims-to-make-ai-accessible-regardless-of-skill-set-with-packaged-ai-models/",
        "description": "SAS, a specialist in data and AI solutions, has unveiled what it describes as a “game-changing approach” for organisations to tackle business challenges head-on.\nIntroducing lightweight, industry-specific AI models for individual licence, SAS hopes to equip organisations with..."
    },
    {
        "title": "80% of AI decision makers are worried about data privacy and security",
        "link": "https://www.artificialintelligence-news.com/2024/04/17/80-of-ai-decision-makers-are-worried-about-data-privacy-and-security/",
        "description": "Organisations are enthusiastic about generative AI’s potential for increasing their business and people productivity, but lack of strategic planning and talent shortages are preventing them from realising its true value.\nThis is according to a study conducted in early 2024 by..."
    },
    {
        "title": "Samsung aims to boost on-device AI with LPDDR5X DRAM",
        "link": "https://www.artificialintelligence-news.com/2024/04/17/samsung-aims-boost-on-device-ai-lpddr5x-dram/",
        "description": "Samsung has unveiled the industry's first LPDDR5X DRAM with speeds of up to 10.7 Gbps, setting a new benchmark for the industry.\nAchieved through the use of cutting-edge 12 nanometer (nm)-class process technology, Samsung has not only attained the highest performance metrics but also..."
    },
    {
        "title": "Kamal Ahluwalia, Ikigai Labs: How to take your business to the next level with generative AI",
        "link": "https://www.artificialintelligence-news.com/2024/04/17/kamal-ahluwalia-ikigai-labs-how-to-take-your-business-to-the-next-level-with-generative-ai/",
        "description": "AI News caught up with president of Ikigai Labs, Kamal Ahluwalia, to discuss all things gen AI, including top tips on how to adopt and utilise the tech, and the importance of embedding ethics into AI design.\nCould you tell us a little bit about Ikigai Labs and how it can help..."
    },
    {
        "title": "Hugging Face launches Idefics2 vision-language model",
        "link": "https://www.artificialintelligence-news.com/2024/04/16/hugging-face-launches-idefics2-vision-language-model/",
        "description": "Hugging Face has announced the release of Idefics2, a versatile model capable of understanding and generating text responses based on both images and texts. The model sets a new benchmark for answering visual questions, describing visual content, story creation from images, document information..."
    },
    {
        "title": "OpenAI chooses Tokyo for its first Asian office",
        "link": "https://www.artificialintelligence-news.com/2024/04/15/openai-chooses-tokyo-first-asian-office/",
        "description": "OpenAI has announced the opening of a new office in Tokyo to drive its expansion into the Asian market.\nThe new office aims to foster collaboration with the Japanese government, local businesses, and research institutions to develop AI tools tailored to Japan's unique..."
    },
    {
        "title": "UK and South Korea to co-host AI Seoul Summit",
        "link": "https://www.artificialintelligence-news.com/2024/04/12/uk-and-south-korea-cohost-ai-seoul-summit/",
        "description": "The UK and South Korea are set to co-host the AI Seoul Summit on the 21st and 22nd of May. This summit aims to pave the way for the safe development of AI technologies, drawing on the cooperative framework laid down by the Bletchley Declaration.\nThe two-day event will feature a..."
    },
    {
        "title": "US and Japan announce sweeping AI and tech collaboration",
        "link": "https://www.artificialintelligence-news.com/2024/04/11/us-and-japan-sweeping-ai-tech-collaboration/",
        "description": "The US and Japan have unveiled a raft of new AI, quantum computing, semiconductors, and other critical technology initiatives.\nThe ambitious plans were announced this week by President Biden and Japanese Prime Minister Kishida Fumio following Kishida's Official Visit to the White..."
    },
    {
        "title": "OpenAI makes GPT-4 Turbo with Vision API generally available",
        "link": "https://www.artificialintelligence-news.com/2024/04/10/openai-gpt-4-turbo-with-vision-api-generally-available/",
        "description": "OpenAI has announced that its powerful GPT-4 Turbo with Vision model is now generally available through the company's API, opening up new opportunities for enterprises and developers to integrate advanced language and vision capabilities into their applications.\nThe launch of GPT-4..."
    },
    {
        "title": "Stability AI unveils 12B parameter Stable LM 2 model and updated 1.6B variant",
        "link": "https://www.artificialintelligence-news.com/2024/04/09/stability-ai-unveils-12b-parameter-stable-lm-2-model-updated-1-6b-variant/",
        "description": "Stability AI has introduced the latest additions to its Stable LM 2 language model series: a 12 billion parameter base model and an instruction-tuned variant. These models were trained on an impressive two trillion tokens across seven languages: English, Spanish, German, Italian, French,..."
    },
    {
        "title": "Microsoft AI opens London hub to access ‘enormous pool’ of talent",
        "link": "https://www.artificialintelligence-news.com/2024/04/08/microsoft-ai-opens-london-hub-enormous-pool-talent/",
        "description": "Microsoft is doubling down on its AI efforts in the UK with the opening of a major new AI hub in London. The Microsoft AI London outpost will focus on advancing state-of-the-art language models, supporting infrastructure, and tooling for foundation models.\nThe hub will be led by AI..."
    },
    {
        "title": "ML Olympiad returns with over 20 challenges",
        "link": "https://www.artificialintelligence-news.com/2024/04/08/ml-olympiad-returns-with-over-20-challenges/",
        "description": "The popular ML Olympiad is back for its third round with over 20 community-hosted machine learning competitions on Kaggle.\nThe ML Olympiad – organised by groups including ML GDE, TFUG, and other ML communities – aims to provide developers with hands-on opportunities to learn and..."
    },
    {
        "title": "Microsoft: China plans to disrupt elections with AI-generated disinformation",
        "link": "https://www.artificialintelligence-news.com/2024/04/05/microsoft-china-plans-disrupt-elections-ai-generated-disinformation/",
        "description": "Beijing is expected to ramp up sophisticated AI-generated disinformation campaigns to influence several high-profile elections in 2024, according to Microsoft's threat intelligence team.\nMicrosoft warned that state-backed Chinese cyber groups – with assistance from North Korean..."
    },
    {
        "title": "Why data quality is critical for marketing in the age of GenAI",
        "link": "https://www.artificialintelligence-news.com/2024/04/04/why-data-quality-critical-marketing-age-of-genai/",
        "description": "A recent survey reveals that CMOs around the world are optimistic and confident about GenAI’s future ability to enhance productivity and create competitive advantage. Seventy per cent are already using GenAI and 19 per cent are testing it. And the main areas they’re exploring are..."
    },
    {
        "title": "How to safeguard your business from AI-generated deepfakes ",
        "link": "https://www.artificialintelligence-news.com/2024/04/03/how-to-safeguard-your-business-ai-generated-deepfakes/",
        "description": "Recently, cybercriminals used ‘deepfake’ videos of the executives of a multinational company to convince the company’s Hong Kong-based employees to wire out US $25.6 million. Based on a video conference call featuring multiple deepfakes, the employees believed that their UK-based chief..."
    },
    {
        "title": "UK and US sign pact to develop AI safety tests",
        "link": "https://www.artificialintelligence-news.com/2024/04/02/uk-and-us-sign-pact-develop-ai-safety-tests/",
        "description": "The UK and US have signed a landmark agreement to collaborate on developing rigorous testing for advanced AI systems, representing a major step forward in ensuring their safe deployments.\nThe Memorandum of Understanding – signed Monday by UK Technology Secretary Michelle Donelan and..."
    },
    {
        "title": "Databricks claims DBRX sets ‘a new standard’ for open-source LLMs",
        "link": "https://www.artificialintelligence-news.com/2024/03/28/databricks-claims-dbrx-new-standard-open-source-llms/",
        "description": "Databricks has announced the launch of DBRX, a powerful new open-source large language model that it claims sets a new bar for open models by outperforming established options like GPT-3.5 on industry benchmarks. \nThe company says the 132 billion parameter DBRX model surpasses..."
    },
    {
        "title": "IPPR: 8M UK careers at risk of ‘job apocalypse’ from AI",
        "link": "https://www.artificialintelligence-news.com/2024/03/27/ippr-8m-uk-careers-at-risk-job-apocalypse-from-ai/",
        "description": "A report by the Institute for Public Policy Research (IPPR) sheds light on the potential impact of AI on the UK job market. The study warns of an imminent 'job apocalypse', threatening to engulf over eight million careers across the nation, unless swift government intervention is..."
    },
    {
        "title": "Large language models could ‘revolutionise the finance sector within two years’",
        "link": "https://www.artificialintelligence-news.com/2024/03/27/large-language-models-could-revolutionsise-the-finance-sector-within-two-years/",
        "description": "Large Language Models (LLMs) have the potential to improve efficiency and safety in the finance sector by detecting fraud, generating financial insights and automating customer service, according to research by The Alan Turing Institute.\nBecause LLMs have an ability to analyse large..."
    },
    {
        "title": "STFC Hartree Centre signs agreement with Lenovo for state-of-the-art supercomputer",
        "link": "https://www.artificialintelligence-news.com/2024/03/26/stfc-hartree-centre-signs-agreement-with-lenovo-for-state-of-the-art-supercomputer/",
        "description": "The Science and Technology Facilities Council (STFC), a UK government agency that carries out research in science and engineering, has signed an agreement with Lenovo for the installation of a powerful new supercomputer for the STFC Hartree Centre.\nTen times more powerful than its..."
    },
    {
        "title": "Stanhope raises £2.3m for AI that teaches machines to ‘make human-like decisions’",
        "link": "https://www.artificialintelligence-news.com/2024/03/25/stanhope-raises-2-3m-for-ai-that-teaches-machines-to-make-human-like-decisions/",
        "description": "Stanhope AI – a company applying decades of neuroscience research to teach machines how to make human-like decisions in the real world – has raised £2.3m in seed funding led by the UCL Technology Fund. \nCreator Fund also participated, along with, MMC Ventures, Moonfire Ventures..."
    },
    {
        "title": "UN passes first global AI resolution",
        "link": "https://www.artificialintelligence-news.com/2024/03/22/un-passes-first-global-ai-resolution/",
        "description": "The UN General Assembly has adopted a landmark resolution on AI, aiming to promote the safe and ethical development of AI technologies worldwide.\nThe resolution, co-sponsored by over 120 countries, was adopted unanimously by all 193 UN member states on 21 March. This marks the first..."
    },
    {
        "title": "AI tool finds cancer signs missed by doctors",
        "link": "https://www.artificialintelligence-news.com/2024/03/21/ai-tool-finds-cancer-signs-missed-by-doctors/",
        "description": "An AI tool has proven capable of detecting signs of cancer that were overlooked by human radiologists.\nThe AI tool, called Mia, was piloted alongside NHS clinicians in the UK and analysed the mammograms of over 10,000 women. \nMost of the participants were cancer-free,..."
    },
    {
        "title": "NVIDIA unveils Blackwell architecture to power next GenAI wave ",
        "link": "https://www.artificialintelligence-news.com/2024/03/19/nvidia-unveils-blackwell-architecture-power-next-genai-wave/",
        "description": "NVIDIA has announced its next-generation Blackwell GPU architecture, designed to usher in a new era of accelerated computing and enable organisations to build and run real-time generative AI on trillion-parameter large language models.\nThe Blackwell platform promises up to 25 times..."
    },
    {
        "title": "Elon Musk’s xAI open-sources Grok",
        "link": "https://www.artificialintelligence-news.com/2024/03/18/elon-musk-xai-open-sources-grok/",
        "description": "Elon Musk's startup xAI has made its large language model Grok available as open source software. The 314 billion parameter model can now be freely accessed, modified, and distributed by anyone under an Apache 2.0 license.\nThe release fulfils Musk's promise to open source Grok in an..."
    },
    {
        "title": "UAE set to help fund OpenAI’s in-house chips",
        "link": "https://www.artificialintelligence-news.com/2024/03/15/uae-set-help-fund-openai-in-house-chips/",
        "description": "OpenAI's ambitious plans to develop its own semiconductor chips for powering advanced AI models could receive a boost from the United Arab Emirates (UAE), according to a report by the Financial Times.\nThe report states that MGX — a state-backed group in Abu Dhabi — is in..."
    },
    {
        "title": "Anthropic says Claude 3 Haiku is the fastest model in its class",
        "link": "https://www.artificialintelligence-news.com/2024/03/14/anthropic-claude-3-haiku-fastest-model-in-class/",
        "description": "Anthropic has released Claude 3 Haiku, the fastest and most affordable AI model in its intelligence class. Boasting state-of-the-art vision capabilities and strong performance on industry benchmarks, Haiku is touted as a versatile solution for a wide range of enterprise..."
    },
    {
        "title": "EU approves controversial AI Act to mixed reactions",
        "link": "https://www.artificialintelligence-news.com/2024/03/13/eu-approves-controversial-ai-act-mixed-reactions/",
        "description": "The European Parliament today approved the AI Act, the first ever regulatory framework governing the use of AI systems. The legislation passed with an overwhelming majority of 523 votes in favour, 46 against and 49 abstentions.\n\"This is a historic day,\" said Italian lawmaker Brando..."
    },
    {
        "title": "Archblock launches new fiat-backed stablecoin",
        "link": "https://www.blockchaintechnology-news.com/2024/04/archblock-launches-new-fiat-backed-stablecoin/",
        "description": "Archblock Stablecoins has launched 1USD, a new fiat-backed stablecoin anchored to the US Dollar.\nThe company said the stablecoin stands as a testament to its own technology, which it claimed is revolutionising the exchange medium, offering frictionless and secure transactions across..."
    },
    {
        "title": "Apex Group harnesses blockchain to open up access to global private market funds ",
        "link": "https://www.blockchaintechnology-news.com/2024/04/apex-group-harnesses-blockchain-to-open-up-access-to-global-private-market-funds/",
        "description": "Apex Group has become the first transfer agent and fund service provider to administer regulated securities, using blockchain as the book of record. \nThis ground-breaking approach enables global private market funds to access a more diverse and significantly larger pool of qualified..."
    },
    {
        "title": "Web3Firewall announces $2.5m pre-seed investment round",
        "link": "https://www.blockchaintechnology-news.com/2024/04/web3firewall-announces-2-5m-pre-seed-investment-round/",
        "description": "Web3Firewall has closed a $2.5m pre-seed investment round led by Laser Digital (Nomura’s digital asset subsidiary) gumi Cryptos Capital (gCC) and SPEILLLP, a member of Susquehanna International Group. \nThe company has developed an intelligence-driven risk and compliance platform..."
    },
    {
        "title": "Rightmove and major banks invest in Coadjute to ‘transform UK property market’",
        "link": "https://www.blockchaintechnology-news.com/2024/04/rightmove-and-major-banks-invest-in-coadjute-to-transform-uk-property-market/",
        "description": "Lloyds Banking Group, Nationwide, NatWest and Rightmove have made a strategic investment in Coadjute, the London-based property technology business. \nThis is the first time that the UK’s three largest mortgage providers have come together to fund a PropTech.\nLloyds Banking..."
    },
    {
        "title": "Quant makes blockchain free to all businesses with new pricing plans",
        "link": "https://www.blockchaintechnology-news.com/2024/04/quant-makes-blockchain-free-to-all-businesses-with-new-pricing-plans/",
        "description": "Quant, a specialist in blockchain for finance, has launched new pricing plans and functionality aimed at enterprise IT users and developers tasked by their business lines with implementing blockchain technology as part of their organisation’s wider digital asset strategy. \nThe..."
    },
    {
        "title": "Lockchain.ai launches as the ‘first AI-powered blockchain risk management platform’",
        "link": "https://www.blockchaintechnology-news.com/2024/04/lockchain-ai-launches-as-the-frst-ai-powered-blockchain-risk-management-platform/",
        "description": "Lockchain.ai has launches, desribed as the market’s first AI-powered risk management platform for blockchain. \nThe Blockchain Risk Management Platform (BRMP) – said to be a new category in the market – sets the standards for mature risk management in digital assets and gives..."
    },
    {
        "title": "Tokenisation: Solving traditional blockchain problems and enticing traditional finance",
        "link": "https://www.blockchaintechnology-news.com/2024/03/tokenisation-solving-traditional-blockchain-problems-and-enticing-traditional-finance/",
        "description": "The long and winding road of blockchain technology adoption has been sometimes tremendous, other times turbulent. If the winds of change are heading in any particular direction right now for the enterprise, however, it appears to be towards tokenisation for real world assets.\nCiti and..."
    },
    {
        "title": "MetaMinds Group partners with NFTrends",
        "link": "https://www.blockchaintechnology-news.com/2024/03/metaminds-group-partners-with-nftrends/",
        "description": "MetaMinds Group, a ‘metaverse as a service’ company providing end-to-end infrastructure and metaverse-ready solutions to luxury and lifestyle brands, has partnered with NFTrends (Numeraire Future Trends), the provider of solutions for authentication, ownership and provenance tracking,..."
    },
    {
        "title": "DePIN project Chirp launches testnet to power decentralised IoT",
        "link": "https://www.blockchaintechnology-news.com/2024/03/depin-project-chirp-launches-testnet-to-power-decentralised-iot/",
        "description": "Chirp Network, a new decentralised physical Infrastructure network (DePIN), is today announcing the launch of its testnet on the Sui blockchain as it unveils a revolutionary IoT network with capabilities far outreaching other decentralised telecommunications protocols, including..."
    },
    {
        "title": "Animoca Brands and Blockpass forge partnership for a secure Web3",
        "link": "https://www.blockchaintechnology-news.com/2024/03/animoca-brands-and-blockpass-forge-partnership-for-a-secure-web3/",
        "description": "Blockpass, a provider of compliant identity verification solutions for the Web3 space, and Animoca Brands, a company advancing digital property rights for gaming and the open metaverse, have teamed up to build a safer and more compliant Web3 environment.\nThis collaboration will..."
    },
    {
        "title": "Supply chain technology provider Finboot announces latest funding round",
        "link": "https://www.blockchaintechnology-news.com/2024/03/14530/",
        "description": "Finboot has completed the first close of its latest funding round to accelerate the next phase of its growth strategy – with a particular focus on enabling companies and their net-zero transition through technology. \nThis latest funding round has been led by a strategic investor..."
    },
    {
        "title": "Crypto Rogue Games closes $1.5m seed round",
        "link": "https://www.blockchaintechnology-news.com/2024/03/crypto-rogue-games-closes-1-5m-seed-round/",
        "description": "Crypto Rogue Games has successfully closed its $1.5m funding round, including game-focused VCs such as Merit Circle and Avalanche, which strongly believes in the studio’s approach to pioneering the future of gaming with the help of web3 technology. \nThe investment round will help..."
    },
    {
        "title": "Goldman Sachs, BNY Mellon take part in Canton Network pilot",
        "link": "https://www.blockchaintechnology-news.com/2024/03/goldman-sachs-bny-mellon-take-part-in-canton-network-pilot/",
        "description": "Goldman Sachs and BNY Mellon were among the participants in a pilot for Digital Asset’s Canton Network, which has been deemed a success in regard to tokenised assets and enterprise blockchain.\nA total of 155 participants, across 45 major organisations, demonstrated settlement across..."
    },
    {
        "title": "Tether to develop blockchain and peer-to-peer telecoms infrastructure for Uzbekistan",
        "link": "https://www.blockchaintechnology-news.com/2024/03/tether-to-develop-blockchain-and-peer-to-peer-telecoms-infrastructure-for-uzbekistan/",
        "description": "Blockchain-enabled platform Tether has signed a Memorandum of Understanding (MOU) with the National Agency of Perspective Projects (NAPP), responsible for crypto regulation and development in the Republic of Uzbekistan. \nThis strategic collaboration aims to position Uzbekistan as a..."
    },
    {
        "title": "TapNation and Immutable partner for Web3 gaming expansion",
        "link": "https://www.blockchaintechnology-news.com/2024/03/tapnation-and-immutable-partner-for-web3-gaming-expansion/",
        "description": "French mobile gaming publishing company TapNation has partnered with Immutable, a developer platform for building & scaling web3 games on Ethereum.\nTapNation’s strategic alliance with Immutable will see the French publisher leverage Immutable’s scaling solution for games that..."
    },
    {
        "title": "Financial sector has experienced rapid growth in cryptojacking",
        "link": "https://www.blockchaintechnology-news.com/2024/03/financial-sector-has-experienced-rapid-growth-in-cryptojacking/",
        "description": "Cybersecurity firm SonicWall has released the 2024 SonicWall Annual Cyber Threat Report, which exposes all types of cyber behaviours and trends from digital adversaries to help partners build data-driven solutions to keep customers safe.\n2023 proved to be a year of volatile, adaptive..."
    },
    {
        "title": "University of Warwick receives £1.25 million to revolutionise AI and financial research",
        "link": "https://www.blockchaintechnology-news.com/2024/03/university-of-warwick-receives-1-25-million-to-revolutionise-ai-and-financial-research/",
        "description": "The University of Warwick has received a £1.25 million donation to launch the FutureFinance.AI Research Group that could transform the way the world purchases, sells, rents and handles real estate over the next five years.\nBased in the Gillmore Centre for Financial Technology at..."
    },
    {
        "title": "More than 60% of countries were developing central bank digital currency in 2023",
        "link": "https://www.blockchaintechnology-news.com/2024/02/more-than-60-of-countries-were-developing-central-bank-digital-currency-in-2023/",
        "description": "Central bank digital currency, or CBDC, became an increasingly trending topic in 2021 after cash payments significantly dropped and cryptocurrencies and stablecoins grabbed news headlines. \nWhile only a handful of countries already launched their CBDCs, many governments are exploring..."
    },
    {
        "title": "Family-run gin distillery uses blockchain for water clarity",
        "link": "https://www.blockchaintechnology-news.com/2024/02/family-run-gin-distillery-uses-blockchain-for-water-clarity/",
        "description": "An artisan, family-run gin distillery near Keith, Moray, Roehill Springs, is using blockchain technology – essentially a digital ledger – to be completely clear about the amount, quality, and provenance of the water used in the creation of its award-winning spirits.\nRoehill..."
    },
    {
        "title": "Panini offers WWE digital assets on its blockchain platform",
        "link": "https://www.blockchaintechnology-news.com/2024/02/panini-offers-wwe-digital-assets-on-its-blockchain-platform/",
        "description": "The Superstars of WWE are joining Panini Blockchain with the release of Blockchain Donruss Elite WWE. The product introduces the Panini digital card debuts of WWE Superstars, including John Cena, 'Stone Cold' Steve Austin, Roman Reigns, Finn Bálor, Damian Priest, Rhea Ripley and Lyra..."
    },
    {
        "title": "Citi develops blockchain FX solution as part of Singapore’s Project Guardian",
        "link": "https://www.blockchaintechnology-news.com/2024/02/citi-develops-blockchain-fx-solution-as-part-of-singapores-project-guardian/",
        "description": "Investment bank and financial services company, Citi, has developed an innovative application that uses blockchain infrastructure to price and execute bilateral spot foreign-exchange (FX) trades. \nThe application is a part of Project Guardian, a collaborative initiative by the..."
    },
    {
        "title": "Quant granted US patent for chronologically ordering blockchain transactions ",
        "link": "https://www.blockchaintechnology-news.com/2024/02/quant-granted-us-patent-for-chronologically-ordering-blockchain-transactions/",
        "description": "Distributed ledger technology (DLT) service provider, Quant, has secured a new patent from the United States Patent and Trademark Office. \nThe patent, titled ‘Blockchain Communications and Ordering’, recognises that Quant has invented a unique method for chronologically ordering..."
    },
    {
        "title": "Ginger Joy raises £1 million for Web3 blockchain-based mobile gaming startup",
        "link": "https://www.blockchaintechnology-news.com/2024/02/ginger-joy-raises-1-million-for-web3-blockchain-based-mobile-gaming-startup/",
        "description": "Ginger Joy, the Web3 mobile gaming startup , has announced its most recent round of fundraising of £1 million. This capital will be used to develop mobile-native gaming ecosystems with blockchain-based interoperability.\nGinger Joy is a spin-off company of Matchingham Games, an..."
    },
    {
        "title": "Web3 platform OpenChrono seeks to make luxury watch transactions safer ",
        "link": "https://www.blockchaintechnology-news.com/2024/02/web3-platform-openchrono-seeks-to-make-luxury-watch-transactions-safer/",
        "description": "Web3 platform OpenChrono has launched, introducing a new transaction standard that could protect consumers and reputable dealers from a secondary market for luxury watches beset by scams and scandal. \nBlue chip watch brands commonly inflate demand for their watches by tightly..."
    },
    {
        "title": "Immutable launches zkEVM Mainnet to improve gaming",
        "link": "https://www.blockchaintechnology-news.com/2024/02/immutable-launches-zkevm-mainnet-to-improve-gaming/",
        "description": "Blockchain gaming specialist Immutable has launched its Immutable zkEVM Mainnet, powered by Polygon. \nThis advancement in blockchain gaming technology is set to expand capabilities within the gaming industry, unlocking new revenue streams for game studios and providing players with..."
    },
    {
        "title": "George Osborne joins Coinbase in advisory role",
        "link": "https://www.blockchaintechnology-news.com/2024/02/george-osborne-joins-coinbase-in-advisory-role/",
        "description": "Former UK chancellor of the exchequer George Osborne has joined US crypto provider Coinbase as part of the firm’s global advisory council.\nThe advisory council is aimed at informing Coinbase’s global strategy. Recent licenses have been secured in France, Singapore, Spain, and..."
    },
    {
        "title": "BT Group chooses Optiva for next-generation app server upgrade",
        "link": "https://www.blockchaintechnology-news.com/2024/01/bt-group-chooses-optiva-for-next-generation-app-server-upgrade/",
        "description": "Fixed and mobile telecommunications provider, BT Group, has extended its strategic partnership with Optiva to develop and monetize new B2B, B2C and B2B2X services. \nOptiva’s application server, a key component of the Optiva Charging Engine, will be upgraded to a next-generation,..."
    },
    {
        "title": "Quant launches Make integration for powerful code-free automation with any blockchain",
        "link": "https://www.blockchaintechnology-news.com/2024/01/quant-launches-make-integration-for-powerful-code-free-automation-with-any-blockchain/",
        "description": "Blockchain for finance firm Quant has launched an integration with automation software provider Make. \nOverledger, Quant’s blockchain-agnostic API platform, is now available to users of Make. This will enable individuals, teams and enterprises to build automated workflows customised..."
    },
    {
        "title": "Many decisions to use blockchain are unnecessary, finds the University of Birmingham",
        "link": "https://www.blockchaintechnology-news.com/2024/01/many-decisions-to-use-blockchain-are-unnecessary-finds-the-university-of-birmingham/",
        "description": "Blockchain technology is probably unnecessary in the majority of cases, despite its popularity, a recent study has concluded.\nIn recent years blockchain technology has been making headlines and boomed in popularity, thanks partly to its use in the cryptocurrency Bitcoin. But, new..."
    },
    {
        "title": "Researchers propose a Web 3.0 streaming architecture and marketplace",
        "link": "https://www.blockchaintechnology-news.com/2024/01/researchers-propose-a-web-3-0-streaming-architecture-and-marketplace/",
        "description": "Web 3.0 is a blockchain technology-based internet paradigm that is transparent and decentralised. But, Web 3.0 streaming services require modifications to the existing service structure due to certain technical issues. \nNow, researchers from Incheon National University have proposed..."
    },
    {
        "title": "AWS Deadline Cloud launched to transform content rendering pipelines",
        "link": "https://www.cloudcomputing-news.net/news/2024/apr/17/aws-deadline-cloud-launched-to-transform-content-rendering-pipelines/",
        "description": "Amazon Web Services (AWS) has unveiled AWS Deadline Cloud, a fully managed service that helps customers set up, deploy and scale rendering projects in minutes, so they can improve the efficiency of their rendering pipelines and take on more work.With Deadline Cloud, customers..."
    },
    {
        "title": "Future-proof your business: cloud storage without the climate cost",
        "link": "https://www.cloudcomputing-news.net/news/2024/apr/15/future-proof-your-business-cloud-storage-without-the-climate-cost/",
        "description": "With over half of all corporate data held in the cloud as of 2022, demand for cloud storage has never been higher. This has triggered extreme energy consumption throughout the data centre industry, leading to hefty greenhouse gas (GHG) emissions.Worryingly, the European Commission..."
    },
    {
        "title": "Anaconda and Teradata partner to enhance open-source support for AI innovation",
        "link": "https://www.cloudcomputing-news.net/news/2024/apr/12/anaconda-and-teradata-partner-to-enhance-open-source-support-for-ai-innovation/",
        "description": "Anaconda and Teradata have unveiled a new integration to bring the most popular and widely used Python and R packages to Teradata VantageCloud through the Anaconda Repository.The integration with ClearScape Analytics, a powerful engine for deploying end-to-end artificial..."
    },
    {
        "title": "Accenture to snap up CLIMB to expand technology capabilities",
        "link": "https://www.cloudcomputing-news.net/news/2024/apr/10/accenture-to-snap-up-climb-to-expand-technology-capabilities/",
        "description": "Professional services firm Accenture has agreed to acquire CLIMB, a technology services provider specialising in system integration, IT infrastructure management and operations, primarily in Gunma, Japan.The acquisition of CLIMB brings more critical skills for global..."
    },
    {
        "title": "Cloud Software Group and Microsoft partner to bring the cloud and generative AI to 100 million+ people",
        "link": "https://www.cloudcomputing-news.net/news/2024/apr/09/cloud-software-group-and-microsoft-partner-to-bring-the-cloud-and-generative-ai-to-100-million-people/",
        "description": "Cloud Software Group and Microsoft announced are deepening their collaboration through an eight-year strategic partnership agreement.The agreement will strengthen the go-to-market collaboration for the Citrix virtual application and desktop platform and support the development of..."
    },
    {
        "title": "Poor architectural visibility leading to cloud cost blowout, report warns",
        "link": "https://www.cloudcomputing-news.net/news/2024/apr/03/poor-architectural-visibility-leading-to-cloud-cost-blowout-report-warns/",
        "description": "Almost three quarters of global companies polled by integration and automation provider Boomi exceeded their cloud budgets last year – and solving perennial problems from excessive storage to overconsumption of bandwidth remains elusive in many cases.The findings were in a report..."
    },
    {
        "title": "Salesforce unveils Einstein Copilot for Tableau",
        "link": "https://www.cloudcomputing-news.net/news/2024/apr/03/salesforce-unveils-einstein-copilot-for-tableau/",
        "description": "Salesforce has introduced the beta version of Einstein Copilot for Tableau, a new capability designed to help users in every role and function explore data with AI assistance. Businesses tend to distribute insights from data in reports and dashboards created by expert analysts...."
    },
    {
        "title": "N-able collaborates with Microsoft to maximise the cloud for MSPs",
        "link": "https://www.cloudcomputing-news.net/news/2024/apr/02/n-able-collaborates-with-microsoft-to-maximise-the-cloud-for-msps/",
        "description": "Software firm N-able has introduced N-able Cloud Commander, a multi-tenant solution for the Microsoft Cloud.Cloud Commander is built with the vision to enable managed services providers (MSPs) to manage, secure, standardise, and automate Microsoft 365 users, Azure resources, and..."
    },
    {
        "title": "The guide for exceptional support: Unlocking cloud success ",
        "link": "https://www.cloudcomputing-news.net/news/2024/mar/28/the-guide-for-exceptional-support-unlocking-cloud-success/",
        "description": "In the fast-evolving realm of cloud distribution and services, achieving success hinges not only on cutting-edge technology but also on robust support systems. From minimising errors to accelerating growth, the importance of comprehensive support cannot be overstated. In this guide, we’ll..."
    },
    {
        "title": "OVHcloud inaugurates quantum computer and offers educational support for the European quantum ecosytem",
        "link": "https://www.cloudcomputing-news.net/news/2024/mar/26/ovhcloud-inaugurates-quantum-computer-and-offers-educational-support-for-the-european-quantum-ecosytem/",
        "description": "Europen cloud provider OVHcloud recentlybrought together the European Quantum ecosystem in Croix France to inaugurate the commissioning of the first Quantum computer available from a European Cloud service provider.At a time when European’s countries express a growing aspiration..."
    },
    {
        "title": "Sopra Banking Software and AWS expand work to bring banks to the cloud",
        "link": "https://www.cloudcomputing-news.net/news/2024/mar/25/sopra-banking-software-and-aws-expand-work-to-bring-banks-to-the-cloud/",
        "description": "Sopra Banking Software (SBS) has joined the Amazon Web Services (AWS) Independent Software Vendor (ISV) Accelerate Program, a co-sell program for AWS Partners who provide software solutions that run on or integrate with AWS.The ISV program helps AWS Partners drive new business and..."
    },
    {
        "title": "GoodData unveils major update to FlexQuery, the revolutionary analytics engine",
        "link": "https://www.cloudcomputing-news.net/news/2024/mar/25/gooddata-unveils-major-update-to-flexquery-the-revolutionary-analytics-engine/",
        "description": "Cloud-based data and analytics platform, GoodData, has released FlexQuery, a foundational component of its business intelligence (BI) and analytics platform.Forming a major cornerstone of its transformative vision for the future of augmented analytics and BI, FlexQuery builds upon..."
    },
    {
        "title": "NVIDIA GTC roundup: Next-gen data centres and cloud provider partnerships",
        "link": "https://www.cloudcomputing-news.net/news/2024/mar/19/nvidia-gtc-roundup-next-gen-data-centres-and-cloud-provider-partnerships/",
        "description": "NVIDIA’s 2024 GTC event, taking place through March 21, saw the usual plethora of announcements one would expect from a major tech conference. One stood out, from founder and CEO Jensen Huang’s keynote: the next-generation Blackwell GPU architecture, enabling organisations to build and run..."
    },
    {
        "title": "World’s first bio circular data centre launches, turning algae into energy",
        "link": "https://www.cloudcomputing-news.net/news/2024/mar/18/worlds-first-bio-circular-data-centre-launches-turning-algae-into-energy/",
        "description": "Data4, a French operator and investor in the data centre market, and the University of Paris-Saclay have signed a partnership agreement to launch a prototyping experiment to reuse some of the heat produced by a data centre.This ground-breaking project will be launched in the Paris..."
    },
    {
        "title": "Spike in cloud account compromises and email forwarding rule abuse detected",
        "link": "https://www.cloudcomputing-news.net/news/2024/mar/18/spike-in-cloud-account-compromises-and-email-forwarding-rule-abuse-detected/",
        "description": "Cybersecurity firm Red Canary has unveiled its sixth annual Threat Detection Report, examining the trends, threats, and adversary techniques that organisations ought to prioritise in the coming months and years.The report tracks MITRE ATT&CK techniques that adversaries abuse..."
    },
    {
        "title": "Half of EMEA cloud costs going to fees, but most plan to increase capacity",
        "link": "https://www.cloudcomputing-news.net/news/2024/mar/14/half-of-emea-cloud-costs-going-to-fees-but-most-plan-to-increase-capacity/",
        "description": "European organisations are still beleaguered by storage bills as 50% of all cloud storage costs in EMEA go to data access and usage fees rather than capacity, according to the 2024 Global Cloud Storage Index from Wasabi Technologies.Still, EMEA companies see the value of cloud..."
    },
    {
        "title": "MongoDB expands availability of MongoDB Atlas to six more cloud regions",
        "link": "https://www.cloudcomputing-news.net/news/2024/mar/13/mongodb-expands-availability-of-mongodb-atlas-to-six-more-cloud-regions/",
        "description": "MongoDB has made its multi-cloud developer data platform MongoDB Atlas available in six additional cloud regions in Canada, Germany, Israel, Italy, and Poland — now said to be the most widely available developer data platform in the world.With this expansion, MongoDB Atlas is now..."
    },
    {
        "title": "Flexera 2024 State of the Cloud: Cost optimisation, FinOps and GenAI key takeaways",
        "link": "https://www.cloudcomputing-news.net/news/2024/mar/12/flexera-2024-state-of-the-cloud-cost-optimisation-finops-and-genai-key-takeaways/",
        "description": "Flexera has admitted that 2024 is a ‘complex’ year for cloud adoption as the company publishes its latest State of the Cloud report – and while cost optimisation remains key, sustainability is slowly emerging as an important differentiator.The report – the 13th – is often..."
    },
    {
        "title": "Akamai extends segmentation solution to hybrid cloud environments",
        "link": "https://www.cloudcomputing-news.net/news/2024/mar/11/akamai-extends-segmentation-solution-to-hybrid-cloud-environments/",
        "description": "Cloud computing company Akamai Technologies, has extended its segmentation solution, Akamai Guardicore Segmentation, to hybrid cloud environments. Extending Akamai Guardicore Segmentation to the cloud helps reduce attack surfaces and helps contain attacks targeting cloud-native..."
    },
    {
        "title": "N-able expands Technology Alliance Program for open ecosystem built for MSPs",
        "link": "https://www.cloudcomputing-news.net/news/2024/mar/08/n-able-expands-technology-alliance-program-for-open-ecosystem-built-for-msps/",
        "description": "N-able, a global software company helping IT services providers deliver remote monitoring and management, data protection as-a-service, and security solutions, has added new vendor alliances to its expanding and enhanced Technology Alliance Program (TAP), a growing, open ecosystem built for..."
    },
    {
        "title": "Rakuten Symphony launches Telco Cloud training through TIP Academy",
        "link": "https://www.cloudcomputing-news.net/news/2024/mar/06/rakuten-symphony-launches-telco-cloud-training-through-tip-academy/",
        "description": "Rakuten Symphony has launched a Telco Cloud curriculum on the Telecom Infra Project’s industry-neutral training platform, the TIP Academy.The Telecom Infra Project (TIP) Academy, launched by TIP in collaboration with Accenture in June 2022, is an industry neutral training platform..."
    },
    {
        "title": "Huawei Mobile Services partners with AVOW and Turismo Andalucía ‘to strengthen bonds’",
        "link": "https://www.cloudcomputing-news.net/news/2024/mar/05/huawei-mobile-services-partners-with-avow-and-turismo-andalucia-to-strengthen-bonds/",
        "description": "HUAWEI Mobile Services (HMS) signed a Memorandum of Understanding (MOU) with the Council of Tourism, Culture, and Sports of the Andalusian Government (Turismo Andalucía) and marketing agency AVOW, aiming to advance mutual goals and capture business opportunities.The MOU signing..."
    },
    {
        "title": "Optiva accelerates competitive edge with generative AI-enabled real-time BSS",
        "link": "https://www.cloudcomputing-news.net/news/2024/mar/01/optiva-accelerates-competitive-edge-with-generative-ai-enabled-real-time-bss/",
        "description": "Optiva, which provides telecoms firms with cloud-native billing, charging and revenue management software on private and public clouds, has revealed that its business support systems (BSS) platform now allows users to leverage generative AI (GenAI) technology to quickly highlight new, targeted..."
    },
    {
        "title": "Kyndryl and Veeam team up to deliver comprehensive cyber resiliency",
        "link": "https://www.cloudcomputing-news.net/news/2024/feb/29/kyndryl-and-veeam-team-up-to-deliver-comprehensive-cyber-resiliency/",
        "description": "Kyndryl, a technology infrastructure services provider, and Veeam Software, a specialist in data replication and protection software, have formed a global strategic alliance.The deal will focus on providing customers with resiliency services supported by innovative technology, expert..."
    },
    {
        "title": "Co-op to transition from data centres to cloud with TCS",
        "link": "https://www.cloudcomputing-news.net/news/2024/feb/27/co-op-to-transition-from-data-centres-to-cloud-with-tcs/",
        "description": "Tata Consultancy Services (TCS) has expanded its partnership with The Co-operative Group Limited (Co-op), one of the world’s largest consumer co-operatives with interests across food, funerals, insurance and legal services, to adopt a cloud first strategy that will support the group’s..."
    },
    {
        "title": "Generative AI ‘commonplace in cloud business models’ – as Azure leads the way",
        "link": "https://www.cloudcomputing-news.net/news/2024/feb/22/generative-ai-commonplace-in-cloud-business-models-as-azure-leads-the-way/",
        "description": "More than seven in 10 cloud environments are employing managed AI services according to a new analysis, with the common use of OpenAI, be it directly or through Azure SDKs, suggesting that generative AI tools are ‘quickly becoming commonplace in cloud business models.’The study,..."
    },
    {
        "title": "Vonage and AWS leverage communications and network APIs to deliver solutions",
        "link": "https://www.cloudcomputing-news.net/news/2024/feb/22/vonage-and-aws-leverage-communications-and-network-apis-to-deliver-solutions/",
        "description": "Vonage, a specialist in cloud communications helping businesses accelerate their digital transformation and a part of Ericsson, has collaborated with Amazon Web Services (AWS) to accelerate the availability of new solutions to millions of AWS developers through AWS..."
    },
    {
        "title": "Salesforce unveils innovations to help utilities scale clean energy program adoption",
        "link": "https://www.cloudcomputing-news.net/news/2024/feb/19/salesforce-unveils-innovations-to-help-utilities-scale-clean-energy-program-adoption/",
        "description": "Salesforce has introduced its Clean Energy Program Management for Energy & Utilities Cloud.The new solution streamlines the launch, management and oversight of energy efficiency, conservation, electrification and EV charging programs. Now program managers at electric, gas..."
    },
    {
        "title": "Why companies continue to struggle with cloud visibility – and code vulnerabilities",
        "link": "https://www.cloudcomputing-news.net/news/2024/feb/15/why-companies-continue-to-struggle-with-cloud-visibility-and-code-vulnerabilities/",
        "description": "A new report from the Cloud Security Alliance (CSA) has thrown up more difficulties organisations are facing in security remediation – and achieving visibility from code to cloud.The report, produced in collaboration with security firm Dazz, polled just over 2,000 IT and security..."
    },
    {
        "title": "SAP Emarsys integrates enterprise loyalty for supercharged personalisation",
        "link": "https://www.cloudcomputing-news.net/news/2024/feb/15/sap-emarsys-integrates-enterprise-loyalty-for-supercharged-personalisation/",
        "description": "Customer loyalty is paramount, but brands are struggling to keep up with consumers’ evolving expectations and complex tech stacks.SAP Emarsys, a customer engagement platform, and Annex Cloud, a SaaS loyalty management platform, are announcing a native integration to incentivise..."
    },
    {
        "title": "Stable Diffusion 3 API delivers powerful image generation",
        "link": "https://www.developer-tech.com/news/2024/apr/18/stable-diffusion-3-api-delivers-powerful-image-generation/",
        "description": "Stability AI is providing the next iteration of its powerful text-to-image model, Stable Diffusion 3, to developers through its API and an innovative new creation platform.\nStable Diffusion 3 was unveiled in February alongside an early preview for a limited group of developers...."
    },
    {
        "title": "Fortifying app security with the help of Terraform",
        "link": "https://www.developer-tech.com/news/2024/apr/18/fortifying-app-security-with-the-help-of-terraform/",
        "description": "A staple of DevOps tech stacks, Terraform is an Infrastructure-as-Code (IaC) provisioning and management tool developed by HashiCorp. While Terraform itself is rarely associated with app security and is not directly related to the safety and cyber protection of applications, using it correctly..."
    },
    {
        "title": "SAS unveils SAS Viya Workbench developer environment for building AI models",
        "link": "https://www.developer-tech.com/news/2024/apr/17/sas-unveils-sas-viya-workbench-developer-environment-for-building-ai-models/",
        "description": "SAS has added expanded capabilities to its SAS Viya flagship data and AI platform, including the general availability of SAS Viya Workbench. \nTargeted to developers and modellers, Viya Workbench is a self-service, on-demand compute environment for conducting data preparation,..."
    },
    {
        "title": "Apple enables web distribution for iOS developers targeting EU users",
        "link": "https://www.developer-tech.com/news/2024/apr/17/apple-enables-web-distribution-ios-developers-eu-users/",
        "description": "Apple has announced that iOS app developers targeting EU users are now able to directly offer downloads from their own websites. This shift comes as a response to the EU's new Digital Markets Act (DMA), requiring major tech platforms to open up their ecosystems and ensure a more competitive..."
    },
    {
        "title": "IDC expects Android to grow at ‘twice the pace of iOS’",
        "link": "https://www.developer-tech.com/news/2024/apr/16/idc-expects-android-grow-twice-pace-ios/",
        "description": "IDC predicts that Android is set for significant growth in 2024, outpacing Apple's iOS by a considerable margin. Amid shifting market dynamics, Android is expected to expand at \"twice the pace\" of iOS.\nThe iPhone has always performed strongly in the US but its growth internationally..."
    },
    {
        "title": "Apple responds to accusation of skirting antitrust ruling",
        "link": "https://www.developer-tech.com/news/2024/apr/15/apple-responds-accusation-skirting-antitrust-ruling/",
        "description": "Apple has requested that a judge dismisses a new complaint by Epic Games, which accuses the Cupertino-based company of failing to adhere to an earlier antitrust ruling.\nThe dispute initially ignited when Epic Games implemented its own in-app payment system within the iPhone platform,..."
    },
    {
        "title": "Android 15 beta improves edge-to-edge, app archiving, and security",
        "link": "https://www.developer-tech.com/news/2024/apr/12/android-15-beta-improves-edge-to-edge-app-archiving-and-security/",
        "description": "Google has released the first Android 15 beta with enhanced screen real estate utilisation, app archiving, and the bolstering of security measures. \nThe tech giant has focused on optimising Android 15 for larger displays, such as those on foldable devices and tablets, by enabling..."
    },
    {
        "title": "GitHub updates Innovation Graph with latest developer trends",
        "link": "https://www.developer-tech.com/news/2024/apr/10/github-updates-innovation-graph-developer-trends/",
        "description": "GitHub's Innovation Graph has been updated with data from Q4 2023, offering a comprehensive view of global developer activity over the past four years.\nThe latest findings highlight the increasing popularity of AI among developers, leading to a rise in project documentation. This..."
    },
    {
        "title": "PARSIQ’s Unicornization Campaign open for entries with 30 April deadline for submissions",
        "link": "https://www.developer-tech.com/news/2024/apr/10/parsiqs-unicornization-campaign-open-30-april-deadline-submissions/",
        "description": "PARSIQ, a full suite data network for building Web3 dApps and protocols, has recently launched its Unicornization Campaign. Designed to propel innovation and further bolster the global blockchain ecosystem, the  campaign’s main focus is to invest in promising Web3 projects on the..."
    },
    {
        "title": "Apple relaxes App Store rules to permit game emulators",
        "link": "https://www.developer-tech.com/news/2024/apr/08/apple-relaxes-app-store-rules-permit-game-emulators/",
        "description": "Apple has loosened its App Store rules to permit the inclusion of \"retro game console emulator apps\" on its platform.\nThis move comes after years of pressure from users and legislators, particularly in Europe, where enthusiasts previously had to resort to jailbreaking their devices or..."
    },
    {
        "title": "Jpegli boosts high-quality image compression by 35%",
        "link": "https://www.developer-tech.com/news/2024/apr/05/jpegli-boosts-high-quality-image-compression-by-35/",
        "description": "Google has introduced Jpegli, a JPEG coding library that maintains high backward compatibility while offering enhanced capabilities and a 35 percent compression ratio improvement at high quality compression settings.\nAccording to Google, the new JPEG coding library is designed to be..."
    },
    {
        "title": "JetBrains launches 2024.1 with local AI code completion",
        "link": "https://www.developer-tech.com/news/2024/apr/04/jetbrains-launches-2024-1-local-ai-code-completion/",
        "description": "JetBrains has released the 2024.1 updates for its IDEs with several major new features, headlined by full-line code autocompletion powered by local AI models.\nThe new full-line code completion functionality ensures code suggestions are processed entirely on the user's device,..."
    },
    {
        "title": "Python skills ‘increasingly essential’ to dev teams venturing into advanced AI",
        "link": "https://www.developer-tech.com/news/2024/apr/03/python-skills-increasingly-essential-to-dev-teams-venturing-into-advanced-ai/",
        "description": "Python’s status as the primary language for AI and machine learning projects, from its extensive data-handling capabilities to its flexibility and portability, is well-founded. Just how well-founded can be seen in new user data from Snowflake.\nThe cloud data provider reported that,..."
    },
    {
        "title": "Bitwarden strengthens passwordless authentication with magic links API",
        "link": "https://www.developer-tech.com/news/2024/apr/02/bitwarden-passwordless-authentication-magic-links-api/",
        "description": "Credential management firm Bitwarden has announced an enhancement to its Passwordless.dev platform with the release of a magic links API.\nBitwarden’s latest offering empowers developers to seamlessly integrate passwordless authentication into their applications, providing a more..."
    },
    {
        "title": "PyPI suspends registrations amid malware attack",
        "link": "https://www.developer-tech.com/news/2024/mar/28/pypi-suspends-registrations-amid-malware-attack/",
        "description": "The Python Package Index (PyPI) has suspended new project creation and user registration to mitigate an ongoing malware upload campaign. This move comes as security researchers at Checkmarx uncovered a campaign involving multiple malicious packages related to the same threat..."
    },
    {
        "title": "Puppet explores the benefits of platform engineering for security",
        "link": "https://www.developer-tech.com/news/2024/mar/28/puppet-explores-the-benefits-of-platform-engineering-for-security/",
        "description": "An increasing number of organisations have built platform teams to help improve the developer experience – and the latest State of DevOps Report from Puppet has looked to show how platform engineering is improving security as well.\nThe 13th annual State of DevOps Report – which is..."
    },
    {
        "title": "Apple refutes all of the DoJ’s antitrust claims",
        "link": "https://www.developer-tech.com/news/2024/mar/27/apple-refutes-all-of-the-dojs-antitrust-claims/",
        "description": "Apple has firmly rejected the US Department of Justice's (DoJ) antitrust claims, dismissing them as either outdated or misrepresentations of the company's business model.\nThe DoJ's antitrust lawsuit against Apple alleges that the tech giant has violated Section 2 of the Sherman..."
    },
    {
        "title": "Backend Software Engineers are Designers Too",
        "link": "https://www.developer-tech.com/news/2024/mar/26/backend-software-engineers-are-designers-too/",
        "description": "In technology, we typically associate 'design' with front-end developers and visual aesthetics - a beautiful website or a visually appealing user interface. But, backend developers are designers too. They are masters of System Design, meticulously crafting the architecture, dependencies, and..."
    },
    {
        "title": "New OutSystems data fabric unifies data across the enterprise  ",
        "link": "https://www.developer-tech.com/news/2024/mar/25/new-outsystems-data-fabric-unifies-data-across-the-enterprise/",
        "description": "OutSystems, a specialist in high-performance application development, has unveiled what it describes as one of the most significant updates to OutSystems Developer Cloud since its initial release. \nWith the launch of OutSystems Data Fabric, organisations can lay the groundwork to..."
    },
    {
        "title": "Redis switches to more restrictive license",
        "link": "https://www.developer-tech.com/news/2024/mar/22/redis-switches-more-restrictive-license/",
        "description": "Leading in-memory database vendor Redis is adopting a dual-licensing model, imposing far stricter terms on companies offering Redis as a service. \nIn an official announcement, Redis Labs stated that starting with version 7.4, Redis will be dual-licensed under the Redis Source..."
    },
    {
        "title": "Epic to launch iOS and Android store with controversial 12% cut",
        "link": "https://www.developer-tech.com/news/2024/mar/21/epic-to-launch-ios-android-store-controversial-12-cut/",
        "description": "In the ongoing saga of tech giants battling over App Store fees and policies, Epic Games is being accused of hypocrisy as it attempts to introduce its own 12 percent commission store.\nThe gaming company – joined by heavyweights like Meta, Microsoft, X, and Match Group – is..."
    },
    {
        "title": "GitHub’s code scanning autofix enters public beta",
        "link": "https://www.developer-tech.com/news/2024/mar/20/github-code-scanning-autofix-public-beta/",
        "description": "GitHub has announced that its code scanning autofix feature, powered by GitHub Copilot and CodeQL, is now available in public beta for all GitHub Advanced Security customers.\nThe autofix tool aims to remediate over two-thirds of vulnerabilities found during code scanning with minimal..."
    },
    {
        "title": "NVIDIA employs GenAI for rapid software vulnerability detection",
        "link": "https://www.developer-tech.com/news/2024/mar/19/nvidia-genai-rapid-software-vulnerability-detection/",
        "description": "NVIDIA has demonstrated how its generative AI technologies can help to quickly identify and mitigate common vulnerabilities and exposures (CVEs) and other software security risks.\nThe NVIDIA NIM and NeMo Retriever microservices – along with the Morpheus accelerated AI framework –..."
    },
    {
        "title": "AI in game development grows despite concerns",
        "link": "https://www.developer-tech.com/news/2024/mar/18/ai-game-development-grows-despite-concerns/",
        "description": "A growing number of game development studios are embracing AI to streamline their processes, according to a new industry report from Unity.\nThe report finds that 62 percent of studios now utilise AI tools at some stage of development. The top use cases include improving character..."
    }
]